In [202]:
import pandas as pd

In [203]:
s= pd.Series([10,20,30,40,50])
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [204]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

In [205]:
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [206]:
df.shape

(4, 3)

In [207]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [208]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [209]:
df= pd.read_csv('employees_past_week.csv', index_col=False)
df.head()

C:\Users\Narasimha\AppData\Local\Temp\ipykernel_22940\2061575603.py:1: ParserWarning: Length of header or names does not match length of data. This leads to a loss of data with index_col=False.
  df= pd.read_csv('employees_past_week.csv', index_col=False)

,email_id,name,role,company_name,company_location
0,john.doe@acme.com,John Doe,Software Engineer,ACME Corporation,San Francisco
1,jane.smith@globex.com,Jane Smith,Product Manager,Globex Inc.,New York
2,robert.j@initech.com,Robert Johnson,Data Analyst,Initech,Boston
3,emily.c@umbrella.com,Emily Clark,Marketing Director,Umbrella Corp,London
4,michael.b@hooli.com,Michael Brown,CTO,Hooli,Palo Alto

In [210]:
df.tail()

,email_id,name,role,company_name,company_location
258,damon.j@robostack.com,Damon Jenkins,Robotics Controls Engineer,RoboStack,Tokyo
259,callie.p@bluestar.com,Callie Parker,Tech Writer,BlueStar,New York
260,matthew.s@xensys.com,Matthew Shaw,Backend Lead,XenSys,Chicago
261,ariel.r@brightai.com,Ariel Reyes,AI Trainer,BrightAI Labs,San Jose
262,eduardo.k@aeroflow.com,Eduardo King,Operations Manager,AeroFlow,Toronto

In [211]:
df.columns

Index(['email_id', 'name', 'role', 'company_name', 'company_location'], dtype='object')

In [212]:
df= pd.read_csv("students.csv", index_col=False)
df.head()

   student_id     name  age  marks  subject      city
0         101    Alice   23   85.0     Math  New York
1         102      Bob   24   78.0  Science   Chicago
2         103  Charlie   22    NaN     Math  New York
3         104    David   25   92.0  Science     Texas
4         105      Eva   23    NaN  English   Chicago

In [213]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  8 non-null      int64
 1   name        8 non-null      object
 2   age         8 non-null      int64
 3   marks       5 non-null      float64
 4   subject     8 non-null      object
 5   city        8 non-null      object
dtypes: float64(1), int64(2), object(3)
memory usage: 516.0+ bytes

In [214]:
df.describe()

       student_id        age      marks
count     8.00000   8.000000   5.000000
mean    104.50000  23.250000  82.000000
std       2.44949   1.035098   9.823441
min     101.00000  22.000000  67.000000
25%     102.75000  22.750000  78.000000
50%     104.50000  23.000000  85.000000
75%     106.25000  24.000000  88.000000
max     108.00000  25.000000  92.000000

In [215]:
df["age"]

0    23
1    24
2    22
3    25
4    23
5    24
6    22
7    23
Name: age, dtype: int64

In [216]:
df[["age", "name"]]

   age     name
0   23    Alice
1   24      Bob
2   22  Charlie
3   25    David
4   23      Eva
5   24    Frank
6   22    Grace
7   23    Helen

In [217]:
df.iloc[2]

student_id         103
name           Charlie
age                 22
marks              NaN
subject           Math
city          New York
Name: 2, dtype: object

In [218]:
df.iloc[2, 0:2]

student_id        103
name          Charlie
Name: 2, dtype: object

In [219]:
df.loc[1, "name":"age"]

name    Bob
age      24
Name: 1, dtype: object

In [220]:
df["age"]>23

0    False
1     True
2    False
3     True
4    False
5     True
6    False
7    False
Name: age, dtype: bool

In [221]:
df[df["age"]>23]

   student_id   name  age  marks  subject     city
1         102    Bob   24   78.0  Science  Chicago
3         104  David   25   92.0  Science    Texas
5         106  Frank   24   67.0     Math    Texas

In [222]:
df.isnull()

   student_id   name    age  marks  subject   city
0       False  False  False  False    False  False
1       False  False  False  False    False  False
2       False  False  False   True    False  False
3       False  False  False  False    False  False
4       False  False  False   True    False  False
5       False  False  False  False    False  False
6       False  False  False  False    False  False
7       False  False  False   True    False  False

In [223]:
df.isnull().sum()

student_id    0
name          0
age           0
marks         3
subject       0
city          0
dtype: int64

In [224]:
df.dropna()

   student_id   name  age  marks  subject      city
0         101  Alice   23   85.0     Math  New York
1         102    Bob   24   78.0  Science   Chicago
3         104  David   25   92.0  Science     Texas
5         106  Frank   24   67.0     Math     Texas
6         107  Grace   22   88.0  English  New York

In [225]:
df.dropna(subset=["age"])

   student_id     name  age  marks  subject      city
0         101    Alice   23   85.0     Math  New York
1         102      Bob   24   78.0  Science   Chicago
2         103  Charlie   22    NaN     Math  New York
3         104    David   25   92.0  Science     Texas
4         105      Eva   23    NaN  English   Chicago
5         106    Frank   24   67.0     Math     Texas
6         107    Grace   22   88.0  English  New York
7         108    Helen   23    NaN  Science     Texas

In [226]:
df["marks"]= df["marks"].fillna(df["marks"].mean())

In [227]:
df

   student_id     name  age  marks  subject      city
0         101    Alice   23   85.0     Math  New York
1         102      Bob   24   78.0  Science   Chicago
2         103  Charlie   22   82.0     Math  New York
3         104    David   25   92.0  Science     Texas
4         105      Eva   23   82.0  English   Chicago
5         106    Frank   24   67.0     Math     Texas
6         107    Grace   22   88.0  English  New York
7         108    Helen   23   82.0  Science     Texas

In [228]:
df.duplicated().sum()

0

In [229]:
df.sort_values("name", ascending=False)

   student_id     name  age  marks  subject      city
7         108    Helen   23   82.0  Science     Texas
6         107    Grace   22   88.0  English  New York
5         106    Frank   24   67.0     Math     Texas
4         105      Eva   23   82.0  English   Chicago
3         104    David   25   92.0  Science     Texas
2         103  Charlie   22   82.0     Math  New York
1         102      Bob   24   78.0  Science   Chicago
0         101    Alice   23   85.0     Math  New York

In [230]:
df.sort_values("age")

   student_id     name  age  marks  subject      city
2         103  Charlie   22   82.0     Math  New York
6         107    Grace   22   88.0  English  New York
0         101    Alice   23   85.0     Math  New York
4         105      Eva   23   82.0  English   Chicago
7         108    Helen   23   82.0  Science     Texas
1         102      Bob   24   78.0  Science   Chicago
5         106    Frank   24   67.0     Math     Texas
3         104    David   25   92.0  Science     Texas

In [231]:
df.groupby("city")["marks"].mean()

city
Chicago     80.000000
New York    85.000000
Texas       80.333333
Name: marks, dtype: float64

In [232]:
df["passed"] = df["marks"] >= 70

In [233]:
df

   student_id     name  age  marks  subject      city  passed
0         101    Alice   23   85.0     Math  New York    True
1         102      Bob   24   78.0  Science   Chicago    True
2         103  Charlie   22   82.0     Math  New York    True
3         104    David   25   92.0  Science     Texas    True
4         105      Eva   23   82.0  English   Chicago    True
5         106    Frank   24   67.0     Math     Texas   False
6         107    Grace   22   88.0  English  New York    True
7         108    Helen   23   82.0  Science     Texas    True

In [234]:
df["marks"]+=5

In [235]:
df

   student_id     name  age  marks  subject      city  passed
0         101    Alice   23   90.0     Math  New York    True
1         102      Bob   24   83.0  Science   Chicago    True
2         103  Charlie   22   87.0     Math  New York    True
3         104    David   25   97.0  Science     Texas    True
4         105      Eva   23   87.0  English   Chicago    True
5         106    Frank   24   72.0     Math     Texas   False
6         107    Grace   22   93.0  English  New York    True
7         108    Helen   23   87.0  Science     Texas    True

In [236]:
df.rename(columns={"marks": "score"})

   student_id     name  age  score  subject      city  passed
0         101    Alice   23   90.0     Math  New York    True
1         102      Bob   24   83.0  Science   Chicago    True
2         103  Charlie   22   87.0     Math  New York    True
3         104    David   25   97.0  Science     Texas    True
4         105      Eva   23   87.0  English   Chicago    True
5         106    Frank   24   72.0     Math     Texas   False
6         107    Grace   22   93.0  English  New York    True
7         108    Helen   23   87.0  Science     Texas    True

In [237]:
df

   student_id     name  age  marks  subject      city  passed
0         101    Alice   23   90.0     Math  New York    True
1         102      Bob   24   83.0  Science   Chicago    True
2         103  Charlie   22   87.0     Math  New York    True
3         104    David   25   97.0  Science     Texas    True
4         105      Eva   23   87.0  English   Chicago    True
5         106    Frank   24   72.0     Math     Texas   False
6         107    Grace   22   93.0  English  New York    True
7         108    Helen   23   87.0  Science     Texas    True

In [238]:
df.rename(columns={"marks": "score"}, inplace=True) # Use inplace = True to modify the original df directly.

In [239]:
df

   student_id     name  age  score  subject      city  passed
0         101    Alice   23   90.0     Math  New York    True
1         102      Bob   24   83.0  Science   Chicago    True
2         103  Charlie   22   87.0     Math  New York    True
3         104    David   25   97.0  Science     Texas    True
4         105      Eva   23   87.0  English   Chicago    True
5         106    Frank   24   72.0     Math     Texas   False
6         107    Grace   22   93.0  English  New York    True
7         108    Helen   23   87.0  Science     Texas    True

In [240]:
import pandas as pd

df = pd.read_csv("students.csv")

# Fill missing marks with average
df["marks"] = df["marks"].fillna(df["marks"].mean())

# Filter passed students
passed = df[df["marks"] >= 50]

# Find topper row (highest marks)
topper = df.loc[df["marks"].idxmax()]

# Save passed students list
passed.to_csv("passed_students.csv", index=False)

print("Topper:")
print(topper)

Topper:
student_id        104
name            David
age                25
marks            92.0
subject       Science
city            Texas
Name: 3, dtype: object

In [241]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [242]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [243]:
df

   student_id     name  age  marks  subject      city
0         101    Alice   23   85.0     Math  New York
1         102      Bob   24   78.0  Science   Chicago
2         103  Charlie   22   82.0     Math  New York
3         104    David   25   92.0  Science     Texas
4         105      Eva   23   82.0  English   Chicago
5         106    Frank   24   67.0     Math     Texas
6         107    Grace   22   88.0  English  New York
7         108    Helen   23   82.0  Science     Texas

In [244]:
em1=pd.read_csv("employees_week1.csv")

In [245]:
em1.head()

              email_id     name               role  company location
0      alice@gmail.com    Alice       Data Analyst   Google       NY
1        bob@yahoo.com      Bob  Software Engineer   Amazon       TX
2  charlie@outlook.com  Charlie        ML Engineer     Meta       CA
3      david@gmail.com    David   Backend Engineer  Netflix       WA
4        eva@yahoo.com      Eva     Data Scientist   Google       NY

In [246]:
em1.set_index("email_id", inplace=True)

In [247]:
em1.columns

Index(['name', 'role', 'company', 'location'], dtype='object')

In [248]:
em1.index.is_unique

True

In [249]:
em1

                        name               role  company location
email_id
alice@gmail.com        Alice       Data Analyst   Google       NY
bob@yahoo.com            Bob  Software Engineer   Amazon       TX
charlie@outlook.com  Charlie        ML Engineer     Meta       CA
david@gmail.com        David   Backend Engineer  Netflix       WA
eva@yahoo.com            Eva     Data Scientist   Google       NY

In [250]:
em1.reset_index(drop=True, inplace=True)

In [251]:
em1.head()

      name               role  company location
0    Alice       Data Analyst   Google       NY
1      Bob  Software Engineer   Amazon       TX
2  Charlie        ML Engineer     Meta       CA
3    David   Backend Engineer  Netflix       WA
4      Eva     Data Scientist   Google       NY

In [252]:
#Example dataframe
edf = pd.DataFrame({
    "Name" : ["Alice", "Bob", "Charlie"],
    "Age" : [24, 27, 22],
    "Marks": [88, 92, 87]
},index= [101, 102, 103])

In [253]:
edf.head()

        Name  Age  Marks
101    Alice   24     88
102      Bob   27     92
103  Charlie   22     87

In [254]:
edf.loc[101]

Name     Alice
Age         24
Marks       88
Name: 101, dtype: object

In [255]:
edf.loc[[101,103]]

        Name  Age  Marks
101    Alice   24     88
103  Charlie   22     87

In [256]:
edf.loc[101:103]

        Name  Age  Marks
101    Alice   24     88
102      Bob   27     92
103  Charlie   22     87

In [257]:
edf.loc[:,"Name"]

101      Alice
102        Bob
103    Charlie
Name: Name, dtype: object

In [258]:
edf

        Name  Age  Marks
101    Alice   24     88
102      Bob   27     92
103  Charlie   22     87

In [259]:
edf.loc[ : , ["Name", "Marks"]]

        Name  Marks
101    Alice     88
102      Bob     92
103  Charlie     87

In [260]:
edf.loc[102,"Marks"]

92

In [261]:
edf.loc[edf["Marks"]<90]

        Name  Age  Marks
101    Alice   24     88
103  Charlie   22     87

In [262]:
edf.loc[edf["Marks"]>90, ["Name", "Marks"]]

    Name  Marks
102  Bob     92

In [263]:
edf.loc[edf["Marks"]<=90, "Marks"] += 5

In [266]:
edf.head()

        Name  Age  Marks
101    Alice   24     93
102      Bob   27     92
103  Charlie   22     92

In [267]:
edf.reset_index(drop = True, inplace=True)

In [268]:
edf   # we can see the index is reset to default 0,1,2

      Name  Age  Marks
0    Alice   24     93
1      Bob   27     92
2  Charlie   22     92

In [269]:
edf.index

RangeIndex(start=0, stop=3, step=1)

In [270]:
edf.set_index("Name", inplace=True)

In [271]:
edf

         Age  Marks
Name
Alice     24     93
Bob       27     92
Charlie   22     92

In [272]:
edf.reset_index(inplace=True)

In [273]:
edf

      Name  Age  Marks
0    Alice   24     93
1      Bob   27     92
2  Charlie   22     92

In [278]:
edf.index = range(100, 100+len(edf))

In [279]:
edf

        Name  Age  Marks
100    Alice   24     93
101      Bob   27     92
102  Charlie   22     92

In [280]:
edf.at[101, "Marks"]

92

In [265]:
edf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 101 to 103
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Marks   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [ ]:
s = pd.read_csv("employees_activity.csv")# s is the dataframe variable

In [284]:
s.dtypes

employee_id      int64
email           object
name            object
role            object
company         object
city            object
experience       int64
joining_date    object
last_login      object
salary           int64
dtype: object

In [285]:
s.head()# display first 5 rows of the dataframe

,employee_id,email,name,role,company,city,experience,joining_date,last_login,salary
0,101,alice@gmail.com,Alice,Data Analyst,Google,New York,2,2022-06-15,2024-03-10,85000
1,102,bob@yahoo.com,Bob,Software Engineer,Amazon,Texas,3,2021-08-01,2024-03-12,95000
2,103,charlie@outlook.com,Charlie,ML Engineer,Meta,California,4,2020-01-20,2024-03-08,120000
3,104,david@gmail.com,David,Backend Engineer,Netflix,Washington,5,2019-11-05,2024-03-01,130000
4,105,eva@yahoo.com,Eva,Data Scientist,Google,New York,3,2021-04-18,2024-03-11,110000

In [ ]:
s["email"]= s["email"].astype("string")
# changing the data type of email column to string

In [290]:
s.dtypes["email"]

string[python]

In [296]:
# converting the multiple column data types
s = s.astype(
    {"email": "string",
     "employee_id": "int64",
     "name": "string",
     "company" : "string",
     "role": "string",
     "salary": "float64",
     "city" : "string"}
)

In [297]:
s.dtypes

employee_id              int64
email           string[python]
name            string[python]
role            string[python]
company         string[python]
city            string[python]
experience               int64
joining_date            object
last_login              object
salary                 float64
dtype: object

In [305]:
s["joining_date"] = pd.to_datetime(s["joining_date"])
s["last_login"] = pd.to_datetime(s["last_login"])

In [307]:
s.dtypes

employee_id              int64
email           string[python]
name            string[python]
role            string[python]
company         string[python]
city            string[python]
experience               int64
joining_date    datetime64[ns]
last_login      datetime64[ns]
salary                 float64
dtype: object

In [311]:
s["email"]= s["email"].str.lower().str.strip()
# str.strip() will clean the email column by removing leading/trailing spaces
# str.lower() will convert the email column to lowercase

In [310]:
s.head()

,employee_id,email,name,role,company,city,experience,joining_date,last_login,salary
0,101,alice@gmail.com,Alice,Data Analyst,Google,New York,2,2022-06-15,2024-03-10,85000.0
1,102,bob@yahoo.com,Bob,Software Engineer,Amazon,Texas,3,2021-08-01,2024-03-12,95000.0
2,103,charlie@outlook.com,Charlie,ML Engineer,Meta,California,4,2020-01-20,2024-03-08,120000.0
3,104,david@gmail.com,David,Backend Engineer,Netflix,Washington,5,2019-11-05,2024-03-01,130000.0
4,105,eva@yahoo.com,Eva,Data Scientist,Google,New York,3,2021-04-18,2024-03-11,110000.0

In [312]:
s[s["email"].str.contains("david@gmail.com")]

,employee_id,email,name,role,company,city,experience,joining_date,last_login,salary
3,104,david@gmail.com,David,Backend Engineer,Netflix,Washington,5,2019-11-05,2024-03-01,130000.0

In [314]:
s[s["email"].str.contains("david@gmail.com",case=False, na=False)]
# case=False makes the search case insensitive
# na=False will ignore NaN values while searching

,employee_id,email,name,role,company,city,experience,joining_date,last_login,salary
3,104,david@gmail.com,David,Backend Engineer,Netflix,Washington,5,2019-11-05,2024-03-01,130000.0

In [315]:
s["Summary"]= s["salary"].apply(lambda x: "Good Salary" if x>=80000 else "Less Salary")

In [316]:
s

,employee_id,email,name,role,company,city,experience,joining_date,last_login,salary,Summary
0,101,alice@gmail.com,Alice,Data Analyst,Google,New York,2,2022-06-15,2024-03-10,85000.0,Good Salary
1,102,bob@yahoo.com,Bob,Software Engineer,Amazon,Texas,3,2021-08-01,2024-03-12,95000.0,Good Salary
2,103,charlie@outlook.com,Charlie,ML Engineer,Meta,California,4,2020-01-20,2024-03-08,120000.0,Good Salary
3,104,david@gmail.com,David,Backend Engineer,Netflix,Washington,5,2019-11-05,2024-03-01,130000.0,Good Salary
4,105,eva@yahoo.com,Eva,Data Scientist,Google,New York,3,2021-04-18,2024-03-11,110000.0,Good Salary
5,106,frank@gmail.com,Frank,Data Analyst,Amazon,Texas,1,2023-02-10,2024-03-09,78000.0,Less Salary
6,107,grace@outlook.com,Grace,ML Engineer,Meta,California,2,2022-07-25,2024-03-07,98000.0,Good Salary
7,108,helen@gmail.com,Helen,Software Engineer,Microsoft,Texas,4,2020-09-12,2024-03-06,105000.0,Good Salary
8,109,ivan@yahoo.com,Ivan,Backend Engineer,Netflix,Washington,6,2018-05-30,2024-02-28,140000.0,Good Salary
9,110,jane@gmail.com,Jane,Data Scientist,Google,New York,5,2019-03-22,2024-03-05,125000.0,Good Salary

In [317]:
ew1= pd.read_csv("employees_week1.csv")
ew2= pd.read_csv("employees_week2.csv")

In [319]:
ew1.head(2)

          email_id   name               role company location
0  alice@gmail.com  Alice       Data Analyst  Google       NY
1    bob@yahoo.com    Bob  Software Engineer  Amazon       TX

In [320]:
ew2.head(2)

          email_id   name                 role    company location
0  alice@gmail.com  Alice  Senior Data Analyst     Google       NY
1    bob@yahoo.com    Bob    Software Engineer  Microsoft       TX

In [321]:
pd.merge(ew1, ew2, on="email_id", how="inner")

,email_id,name_x,role_x,company_x,location_x,name_y,role_y,company_y,location_y
0,alice@gmail.com,Alice,Data Analyst,Google,NY,Alice,Senior Data Analyst,Google,NY
1,bob@yahoo.com,Bob,Software Engineer,Amazon,TX,Bob,Software Engineer,Microsoft,TX
2,charlie@outlook.com,Charlie,ML Engineer,Meta,CA,Charlie,ML Engineer,Meta,CA
3,david@gmail.com,David,Backend Engineer,Netflix,WA,David,Backend Engineer,Netflix,WA
4,eva@yahoo.com,Eva,Data Scientist,Google,NY,Eva,Senior Data Scientist,Google,NY

In [ ]:
merged=pd.merge(ew1[["email_id","company","location"]], ew2[["email_id","company","location"]], on="email_id", how="inner", suffixes=("_old", "_new"))
#if we didn't mentioned suffixes parameter, then it will take default suffixes _x and _y
#merged= ew1["email_id","company","location"].merge(ew2["email_id","company","location"], on="email_id", how="inner")

In [330]:
merged

              email_id company_old location_old company_new location_new
0      alice@gmail.com      Google           NY      Google           NY
1        bob@yahoo.com      Amazon           TX   Microsoft           TX
2  charlie@outlook.com        Meta           CA        Meta           CA
3      david@gmail.com     Netflix           WA     Netflix           WA
4        eva@yahoo.com      Google           NY      Google           NY

In [333]:
pd.concat([ew1, ew2]) # row-wise concatenation

              email_id     name                   role    company location
0      alice@gmail.com    Alice           Data Analyst     Google       NY
1        bob@yahoo.com      Bob      Software Engineer     Amazon       TX
2  charlie@outlook.com  Charlie            ML Engineer       Meta       CA
3      david@gmail.com    David       Backend Engineer    Netflix       WA
4        eva@yahoo.com      Eva         Data Scientist     Google       NY
0      alice@gmail.com    Alice    Senior Data Analyst     Google       NY
1        bob@yahoo.com      Bob      Software Engineer  Microsoft       TX
2  charlie@outlook.com  Charlie            ML Engineer       Meta       CA
3      david@gmail.com    David       Backend Engineer    Netflix       WA
4        eva@yahoo.com      Eva  Senior Data Scientist     Google       NY

In [335]:
pd.concat([ew1, ew2], ignore_index=True)

              email_id     name                   role    company location
0      alice@gmail.com    Alice           Data Analyst     Google       NY
1        bob@yahoo.com      Bob      Software Engineer     Amazon       TX
2  charlie@outlook.com  Charlie            ML Engineer       Meta       CA
3      david@gmail.com    David       Backend Engineer    Netflix       WA
4        eva@yahoo.com      Eva         Data Scientist     Google       NY
5      alice@gmail.com    Alice    Senior Data Analyst     Google       NY
6        bob@yahoo.com      Bob      Software Engineer  Microsoft       TX
7  charlie@outlook.com  Charlie            ML Engineer       Meta       CA
8      david@gmail.com    David       Backend Engineer    Netflix       WA
9        eva@yahoo.com      Eva  Senior Data Scientist     Google       NY

In [337]:
pd.concat([ew1, ew2], ignore_index=True,axis=1)

,0,1,2,3,4,5,6,7,8,9
0,alice@gmail.com,Alice,Data Analyst,Google,NY,alice@gmail.com,Alice,Senior Data Analyst,Google,NY
1,bob@yahoo.com,Bob,Software Engineer,Amazon,TX,bob@yahoo.com,Bob,Software Engineer,Microsoft,TX
2,charlie@outlook.com,Charlie,ML Engineer,Meta,CA,charlie@outlook.com,Charlie,ML Engineer,Meta,CA
3,david@gmail.com,David,Backend Engineer,Netflix,WA,david@gmail.com,David,Backend Engineer,Netflix,WA
4,eva@yahoo.com,Eva,Data Scientist,Google,NY,eva@yahoo.com,Eva,Senior Data Scientist,Google,NY

In [ ]:
ew1.compare(ew2)# in my opinion it is waste of comparing all unneccessary columns, so we can use merge method for sorting the columns to be compared.

             role                        company
             self                  other    self      other
0    Data Analyst    Senior Data Analyst     NaN        NaN
1             NaN                    NaN  Amazon  Microsoft
4  Data Scientist  Senior Data Scientist     NaN        NaN

In [366]:
changed_company = ew1["company"] != ew2["company"]   
changed_company

0    False
1     True
2    False
3    False
4    False
Name: company, dtype: bool

In [348]:
ew1.loc[changed_company]

        email_id name               role company location
1  bob@yahoo.com  Bob  Software Engineer  Amazon       TX

In [364]:
changed_role = ew1["role"] != ew2["role"]

In [ ]:
changed=ew1[changed_company | changed_role]   
changed
 #it will store only ew1 rows which are changed company or role
 # if we need ew2 rows then we can do similarly

          email_id   name               role company location
0  alice@gmail.com  Alice       Data Analyst  Google       NY
1    bob@yahoo.com    Bob  Software Engineer  Amazon       TX
4    eva@yahoo.com    Eva     Data Scientist  Google       NY

In [361]:
changed.loc[changed_role,"status"] = "role_changed"
changed.loc[changed_company,"status"] = "company_changed"

In [362]:
changed.head()

          email_id   name               role company location           status
0  alice@gmail.com  Alice       Data Analyst  Google       NY     role_changed
1    bob@yahoo.com    Bob  Software Engineer  Amazon       TX  company_changed
4    eva@yahoo.com    Eva     Data Scientist  Google       NY     role_changed

In [5]:
# importing the pandas library as pd for simple and easy access
import pandas as pd

In [6]:
# Assigning the variable names to the files to be read
emp1= r"C:\Users\Narasimha\Desktop\Agent2_sample\scrapers\data\raw\employees_past_week.csv"
emp2= r"C:\Users\Narasimha\Desktop\Agent2_sample\scrapers\data\raw\employees_present_week.csv"

In [7]:
# Define the columns to be used and their data types
USECOLS =[0,1,2,3,4]
DTYPES={ 0: "string",
         1: "string",
         2: "string",
         3: "string",
         4: "string"
       }

In [8]:
df1= pd.read_csv(emp1, usecols=USECOLS, dtype=DTYPES, index_col = False)
df2= pd.read_csv(emp2, usecols=USECOLS, dtype=DTYPES, index_col=False)

In [9]:
df1.columns= ["email_id", "name","role", "company_name", "company_location"]
df2.columns= ["email_id", "name","role", "company_name", "company_location"]

In [10]:
# clean data by removing leading/trailing spaces and converting to lowercase
for df in [df1,df2]:
    df["email_id"]= df["email_id"].str.lower().str.strip()
    df["name"]= df["name"].str.lower().str.strip()
    df["role"]= df["role"].str.lower().str.strip()
    df["company_name"]= df["company_name"].str.lower().str.strip()
    df["company_location"]= df["company_location"].str.lower().str.strip()

In [18]:
#merge only needed columns to identify changes
merged=df1[["email_id", "role", "company_name", "company_location"]].merge(
    df2[["email_id", "role", "company_name"]],
    on="email_id",
    how="inner",
    suffixes=("_old", "_new")
)
merged.head()

,email_id,role_old,company_name_old,company_location,role_new,company_name_new
0,john.doe@acme.com,software engineer,acme corporation,san francisco,software engineer,acme corporation
1,jane.smith@globex.com,product manager,globex inc.,new york,product manager,globex inc.
2,robert.j@initech.com,data analyst,initech,boston,data analyst,initech
3,emily.c@umbrella.com,marketing director,umbrella corp,london,marketing director,umbrella corp
4,michael.b@hooli.com,cto,hooli,palo alto,cto,hooli

In [ ]:
# Identify changes in company_name and role
company_changed = merged["company_name_old"] != merged["company_name_new"]
role_changed = merged["role_old"] != merged["role_new"]
role_changed.head()  # it will store boolean values indicating if role has changed

0    False
1    False
2    False
3    False
4    False
dtype: boolean

In [27]:
#creation of new dataset with changes only
changed_rows= merged[company_changed | role_changed].copy()
changed_rows.loc[role_changed,"status"]= "role changed"
changed_rows.loc[company_changed, "status"]= "company_changed"
changed_rows.tail()

,email_id,role_old,company_name_old,company_location,role_new,company_name_new,status
65,sienna.b@crescent.com,operations lead,crescent solutions,new york,operations lead,crescent global,company_changed
84,logan.k@serenity.com,healthcare analyst,serenity health,london,healthcare analyst,serenity global,company_changed
123,laura.d@avant.com,business intelligence analyst,avant bi,london,business intelligence analyst,avant data,company_changed
124,julian.h@maxwell.com,investment analyst,maxwell investments,toronto,investment strategist,maxwell investments,role changed
138,tristan.h@datacore.com,data infrastructure engineer,datacore,boston,data solutions engineer,datacore,role changed

In [29]:
changed_rows["Company (Location)"] = (
    changed_rows["company_name_old"] + "(" + changed_rows["company_location"] + ")" ).copy()

In [30]:
new_dataset= changed_rows[["email_id", "Company (Location)", "role_old", "status"]].copy()

In [31]:
new_dataset

,email_id,Company (Location),role_old,status
16,chris.p@apex.com,apex solutions(dublin),it support specialist,company_changed
19,sophia.t@everest.com,everest consulting(zurich),business analyst,company_changed
21,victoria.n@lumina.com,lumina designs(new york),product designer,company_changed
22,mark.d@fusion.com,fusion robotics(tokyo),robotics engineer,company_changed
23,paula.s@quantum.com,quantum ai(singapore),machine learning engineer,company_changed
26,brian.c@altair.com,altair security(chicago),cybersecurity analyst,company_changed
30,rachel.p@cypher.com,cypher ai(london),ai ethics specialist,company_changed
47,hailey.d@monarch.com,monarch industries(london),product analyst,company_changed
50,colin.b@astro.com,astro cloud(chicago),cloud security specialist,company_changed
55,ariana.l@polar.com,polar studios(toronto),design lead,company_changed
65,sienna.b@crescent.com,crescent solutions(new york),operations lead,company_changed
84,logan.k@serenity.com,serenity health(london),healthcare analyst,company_changed
123,laura.d@avant.com,avant bi(london),business intelligence analyst,company_changed
124,julian.h@maxwell.com,maxwell investments(toronto),investment analyst,role changed
138,tristan.h@datacore.com,datacore(boston),data infrastructure engineer,role changed